Repository: jansoganci/fortunia
Catalog: fortunia/fortunia/*.lproj/Localizable.strings
Languages: es

# welcome_message
source: Welcome to Fortunia!
es: ¡Bienvenido a Fortunia!

# auth_welcome_title
source: Welcome to Fortunia
es: Bienvenido a Fortunia

# auth_welcome_subtitle
source: Discover your fortune through ancient wisdom
es: Descubre tu fortuna a través de la sabiduría antigua

# auth_continue_with_email
source: Continue with Email
es: Continuar con Email

# auth_not_now
source: Not Now
es: Ahora No

# auth_terms
source: Terms of Service
es: Términos de Servicio

# auth_privacy
source: Privacy Policy
es: Política de Privacidad

# auth_by_continuing
source: By continuing, you agree to our
es: Al continuar, aceptas nuestros

# auth_and
source: and
es: y

# auth_create_account
source: Create Account
es: Crear Cuenta

# auth_sign_in
source: Sign In
es: Iniciar Sesión

# auth_welcome_back
source: Welcome back
es: Bienvenido de vuelta

# auth_join_mystical
source: Join the mystical journey
es: Únete al viaje místico

# auth_email
source: Email
es: Correo Electrónico

# auth_password
source: Password
es: Contraseña

# auth_confirm_password
source: Confirm Password
es: Confirmar Contraseña

# auth_already_have_account
source: Already have an account?
es: ¿Ya tienes una cuenta?

# auth_dont_have_account
source: Don't have an account?
es: ¿No tienes una cuenta?

# auth_sign_up
source: Sign Up
es: Registrarse

# auth_cancel
source: Cancel
es: Cancelar

# auth_ok
source: OK
es: Aceptar

# splash_tagline
source: Discover Your Fortune
es: Descubre Tu Fortuna

# home_discover_fortune
source: Discover Your Fortune
es: Descubre Tu Fortuna

# home_choose_reading_method
source: Choose your reading method
es: Elige tu método de lectura

# home_face_reading
source: Face Reading
es: Lectura Facial

# home_face_reading_desc
source: Discover your personality
es: Descubre tu personalidad

# home_palm_reading
source: Palm Reading
es: Lectura de Palma

# home_palm_reading_desc
source: Read your life lines
es: Lee las líneas de tu vida

# home_tarot_cards
source: Tarot Cards
es: Cartas del Tarot

# home_tarot_cards_desc
source: Get guidance from cards
es: Obtén orientación de las cartas

# home_coffee_reading
source: Coffee Reading
es: Lectura de Café

# home_coffee_reading_desc
source: Interpret coffee grounds
es: Interpreta los posos de café

# result_your_face_reading
source: Your Face Reading
es: Tu Lectura Facial

# result_your_palm_reading
source: Your Palm Reading
es: Tu Lectura de Palma

# result_your_coffee_reading
source: Your Coffee Reading
es: Tu Lectura de Café

# result_your_tarot_reading
source: Your Tarot Reading
es: Tu Lectura de Tarot

# result_your_reading
source: Your Face Reading
es: Tu Lectura Facial

# result_heading
source: A Journey of a Thousand Miles Begins with a Single Step
es: Un Viaje de Mil Millas Comienza con un Solo Paso

# result_text
source: The lines on your forehead suggest a path of creativity and exploration. Your strong jawline indicates determination and resilience in the face of challenges. Trust your intuition in the coming weeks, as a significant opportunity for personal growth will present itself. Embrace change, for it will lead you to a future brighter than you can imagine.
es: Las líneas en tu frente sugieren un camino de creatividad y exploración. Tu mandíbula fuerte indica determinación y resistencia ante los desafíos. Confía en tu intuición en las próximas semanas, ya que se presentará una oportunidad significativa para el crecimiento personal. Abraza el cambio, porque te llevará a un futuro más brillante de lo que puedes imaginar.

# result_disclaimer
source: For entertainment purposes only. Not a substitute for professional, medical, legal, or financial advice.
es: Solo con fines de entretenimiento. No sustituye asesoramiento profesional, médico, legal o financiero.

# result_share_fortune
source: Share Your Fortune
es: Compartir Tu Fortuna

# result_get_another_reading
source: Get Another Reading
es: Obtener Otra Lectura

# processing_reading_fortune
source: Reading your fortune...
es: Leyendo tu fortuna...

# capture_essence
source: Capture Your Essence
es: Captura Tu Esencia

# capture_essence_subtitle
source: For the best reading, please provide a clear, forward-facing photo.
es: Para la mejor lectura, proporciona una foto clara de frente.

# supabase_invalid_image_data
source: Failed to compress image data
es: Error al comprimir la imagen

# supabase_upload_failed
source: Image upload failed
es: Error al subir la imagen

# supabase_invalid_url
source: Invalid Supabase URL configuration
es: Configuración de URL de Supabase no válida

# supabase_function_failed
source: Edge function failed
es: Error en la función de borde

# supabase_auth_failed
source: Authentication failed
es: Error de autenticación

# supabase_network_error
source: Network connection error
es: Error de conexión de red

# supabase_quota_exceeded
source: Daily quota exceeded
es: Cuota diaria excedida

# supabase_ai_failed
source: AI processing failed
es: Error en el procesamiento de IA

# supabase_image_uploaded
source: Image uploaded successfully
es: Imagen subida exitosamente

# supabase_function_executed
source: Edge function executed successfully
es: Función de borde ejecutada exitosamente

# supabase_auth_success
source: Authentication successful
es: Autenticación exitosa

# supabase_quota_consumed
source: Quota consumed successfully
es: Cuota consumida exitosamente

# network_invalid_url
source: Invalid URL
es: URL no válida

# network_no_data
source: No data received
es: No se recibieron datos

# network_decoding_error
source: Failed to decode response
es: Error al decodificar la respuesta

# network_server_error
source: Server error
es: Error del servidor

# network_network_error
source: Network error
es: Error de red

# network_unknown_error
source: Unknown error
es: Error desconocido

source: Select Language
es: Seleccionar Idioma

# current_language_desc
source: Change the app's language. The app will update immediately.
es: Cambia el idioma de la aplicación. La aplicación se actualizará inmediatamente.

source: Current Language:
es: Idioma Actual:

source: Choose Language:
es: Elige el Idioma:

# language_change_info
source: The app will restart language immediately when you change it.
es: La aplicación se reiniciará el idioma inmediatamente cuando lo cambies.

source: Language Settings
es: Configuración de Idioma

source: Change Language
es: Cambiar Idioma

source: Language
es: Idioma

source: Profile
es: Perfil

source: Theme Settings
es: Configuración de Tema

source: Theme
es: Tema

# processing_error_title
source: Processing Error
es: Error de procesamiento

# ok_button
source: OK
es: Aceptar

# tab_home
source: Home
es: Inicio

# tab_explore
source: Explore
es: Explorar

# tab_history
source: History
es: Historial

# tab_profile
source: Profile
es: Perfil

# history_title
source: History
es: Historial

# history_loading
source: Loading your history...
es: Cargando tu historial...

# history_empty_title
source: No Readings Yet
es: Aún No Hay Lecturas

# history_empty_subtitle
source: Your fortune readings will appear here
es: Tus lecturas de fortuna aparecerán aquí

# history_delete
source: Delete
es: Eliminar

source: Unlock Premium
es: Desbloquear Premium

# upgrade_to_premium_desc
source: Get unlimited readings and exclusive features
es: Obtén lecturas ilimitadas y funciones exclusivas

# tap_to_edit_birth_info
source: Tap to edit birth information
es: Toca para editar información de nacimiento

source: Account
es: Cuenta

source: Sign Out
es: Cerrar Sesión

# sign_out_confirmation
source: Are you sure you want to sign out?
es: ¿Estás seguro de que quieres cerrar sesión?

# cancel_button
source: Cancel
es: Cancelar

# done_button
source: Done
es: Hecho

source: Privacy Policy
es: Política de Privacidad

source: Terms of Service
es: Términos de Servicio

# quota_daily_readings
source: Daily Readings
es: Lecturas Diarias

# quota_unlimited
source: Unlimited
es: Ilimitado

# quota_remaining
source: remaining
es: restantes

# quota_upgrade_button
source: Upgrade
es: Mejorar

# birth_details_title
source: Your Birth Details
es: Tus Datos de Nacimiento

# birth_date_picker
source: Birth Date
es: Fecha de Nacimiento

# birth_time_picker
source: Birth Time
es: Hora de Nacimiento

# birth_city_placeholder
source: City of Birth
es: Ciudad de Nacimiento

# birth_country_placeholder
source: Country of Birth
es: País de Nacimiento

# birth_save_continue_button
source: Save & Continue
es: Guardar y Continuar

# birth_cancel_button
source: Cancel
es: Cancelar

# birth_save_success
source: Birth details saved successfully
es: Datos de nacimiento guardados exitosamente

# birth_save_error
source: Failed to save birth details
es: Error al guardar los datos de nacimiento

# birth_loading
source: Saving...
es: Guardando...

# birth_next_button
source: Next
es: Siguiente

# birth_date_step_title
source: Birth Date & Time
es: Fecha y Hora de Nacimiento

# birth_date_step_subtitle
source: When were you born?
es: ¿Cuándo naciste?

# birth_location_step_title
source: Birth Location
es: Lugar de Nacimiento

# birth_location_step_subtitle
source: Where were you born?
es: ¿Dónde naciste?

# face_reading_intro_title
source: Face Reading
es: Lectura Facial

# face_reading_intro_desc
source: Discover the secrets hidden in your facial features. Our AI analyzes your unique traits to reveal insights about your personality, strengths, and future path.
es: Descubre los secretos ocultos en tus rasgos faciales. Nuestra IA analiza tus características únicas para revelar información sobre tu personalidad, fortalezas y camino futuro.

# face_reading_nav_title
source: Face Reading
es: Lectura Facial

# palm_reading_intro_title
source: Palm Reading
es: Lectura de Palma

# palm_reading_intro_desc
source: Unveil the mysteries written in your hands. Our AI analyzes your palm lines to reveal insights about your life journey, personality traits, and future possibilities.
es: Desvela los misterios escritos en tus manos. Nuestra IA analiza las líneas de tu palma para revelar información sobre tu viaje de vida, rasgos de personalidad y posibilidades futuras.

# palm_reading_nav_title
source: Palm Reading
es: Lectura de Palma

# coffee_reading_intro_title
source: Coffee Reading
es: Lectura de Café

# coffee_reading_intro_desc
source: Interpret the patterns in your coffee grounds. Our AI analyzes the unique formations to provide insights about your past, present, and future.
es: Interpreta los patrones en los posos de tu café. Nuestra IA analiza las formaciones únicas para proporcionar información sobre tu pasado, presente y futuro.

# coffee_reading_nav_title
source: Coffee Reading
es: Lectura de Café

# intro_get_started_button
source: Get Started
es: Comenzar

# photo_capture_title
source: Add Your Photo
es: Captura Tu Esencia

# photo_capture_subtitle_face
source: For the best reading, please provide a clear, forward-facing photo of your face.
es: Para la mejor lectura, proporciona una foto clara de frente de tu rostro.

# photo_capture_subtitle_palm
source: For the best reading, please provide a clear photo of your palm with lines visible.
es: Para la mejor lectura, proporciona una foto clara de tu palma con las líneas visibles.

# photo_capture_subtitle_coffee
source: For the best reading, please provide a clear photo of your coffee cup with the grounds visible.
es: Para la mejor lectura, proporciona una foto clara de tu taza de café con los posos visibles.

# photo_capture_subtitle
source: Take a clear photo or choose from your library
es: Para la mejor lectura, proporciona una foto clara.

# photo_take_button
source: Take Photo
es: Tomar Foto

# photo_choose_library_button
source: Choose from Library
es: Elegir de la Biblioteca

# photo_nav_title
source: Add Photo
es: Agregar Foto

# processing_reading_message
source: Reading your fortune...
es: Leyendo tu fortuna...

# coming_soon_title
source: Coming Soon
es: Próximamente

# coming_soon_subtitle
source: We're working on something magical for you.
es: Estamos trabajando en algo mágico para ti.

# reading_type_face
source: Face Reading
es: Lectura Facial

# reading_type_face_desc
source: Discover your personality through facial features
es: Descubre tu personalidad a través de tus rasgos faciales

# reading_type_palm
source: Palm Reading
es: Lectura de Palma

# reading_type_palm_desc
source: Read your life lines and destiny
es: Lee las líneas de tu vida y destino

# reading_type_tarot
source: Tarot Reading
es: Lectura de Tarot

# reading_type_tarot_desc
source: Get guidance from ancient tarot cards
es: Obtén orientación de las cartas del tarot antiguas

# reading_type_coffee
source: Coffee Reading
es: Lectura de Café

# reading_type_coffee_desc
source: Interpret your future from coffee grounds
es: Interpreta tu futuro a partir de los posos de café

# cultural_origin_chinese
source: Chinese
es: Chino

# cultural_origin_chinese_desc
source: Ancient Chinese divination traditions
es: Tradiciones de adivinación china antigua

# cultural_origin_middle_eastern
source: Middle Eastern
es: Medio Oriente

# cultural_origin_middle_eastern_desc
source: Middle Eastern mystical practices
es: Prácticas místicas del Medio Oriente

# cultural_origin_european
source: European
es: Europeo

# cultural_origin_european_desc
source: European fortune telling methods
es: Métodos europeos de adivinación

# cultural_origin_turkish
source: Turkish
es: Turco

# debug_auth_success
source: Success
es: Éxito

# debug_auth_failed
source: Failed
es: Falló

# debug_auth_signup
source: Sign Up
es: Registro

# debug_auth_signin
source: Sign In
es: Iniciar Sesión

# debug_auth_signout
source: Sign Out
es: Cerrar Sesión

# debug_auth_reset
source: Password Reset
es: Restablecer Contraseña

# debug_auth_refresh
source: Session Refresh
es: Actualizar Sesión

# debug_auth_delete
source: Account Deletion
es: Eliminar Cuenta

# debug_ai_success
source: Processing completed
es: Procesamiento completado

# debug_ai_failed
source: Processing failed
es: Procesamiento falló

# debug_network_success
source: Request successful
es: Solicitud exitosa

# debug_network_failed
source: Request failed
es: Solicitud falló

# debug_storage_success
source: Operation completed
es: Operación completada

# debug_storage_failed
source: Operation failed
es: Operación falló

# debug_storage_upload
source: Upload
es: Subir

# debug_storage_download
source: Download
es: Descargar

# debug_storage_delete
source: Delete
es: Eliminar

# debug_edge_success
source: Function executed
es: Función ejecutada

# debug_edge_failed
source: Function failed
es: Función falló

# debug_category_analytics
source: ANALYTICS
es: ANALÍTICAS

# debug_category_performance
source: PERFORMANCE
es: RENDIMIENTO

# preview_light_mode
source: Light Mode
es: Modo Claro

# preview_dark_mode
source: Dark Mode
es: Modo Oscuro

# photo_continue_button
source: Continue
es: Continuar

# photo_retake_button
source: Retake Photo
es: Volver a Tomar

# photo_preview_placeholder
source: Your photo will appear here
es: Tu foto aparecerá aquí

# photo_uploading
source: Uploading photo...
es: Subiendo foto...

# photo_error_title
source: Photo Error
es: Error de Foto

# photo_error_ok
source: OK
es: Aceptar

# photo_upload_error
source: Failed to upload photo. Please try again.
es: Error al subir la foto. Inténtalo de nuevo.

# photo_invalid_image
source: Invalid image selected. Please try again.
es: Imagen inválida seleccionada. Inténtalo de nuevo.

# photo_camera_permission
source: camera
es: cámara

# photo_library_permission
source: photo library
es: biblioteca de fotos

# photo_permission_denied
source: Permission denied for %@. Please enable access in Settings.
es: Permiso denegado para %@. Por favor habilita el acceso en Configuración.

# share_fortune_title
source: My Fortune Reading
es: Mi Lectura de Fortuna

# share_reading_type
source: Reading Type
es: Tipo de Lectura

# share_app_attribution
source: Get your own reading at fortunia.app
es: Obtén tu propia lectura en fortunia.app

# share_error_title
source: Share Error
es: Error de Compartir

# share_error_ok
source: OK
es: Aceptar

# share_error_generation_failed
source: Failed to generate share card: %@
es: Error al generar tarjeta de compartir: %@

# share_error_invalid_url
source: Invalid share card URL
es: URL de tarjeta de compartir inválida

# share_error_invalid_image
source: Invalid share card image data
es: Datos de imagen de tarjeta de compartir inválidos

# share_error_network
source: Network error while loading share card
es: Error de red al cargar tarjeta de compartir

# result_generating_share_card
source: Generating Share Card...
es: Generando Tarjeta de Compartir...

# result_sample_text
source: Your mystical journey reveals great wisdom and prosperity ahead. The stars align in your favor, bringing opportunities for growth and happiness.
es: Tu viaje místico revela gran sabiduría y prosperidad por delante. Las estrellas se alinean a tu favor, trayendo oportunidades de crecimiento y felicidad.

# no_internet_title
source: No Internet Connection
es: Sin Conexión a Internet

# no_internet_message
source: Please check your network and try again.
es: Por favor verifica tu red e inténtalo de nuevo.

# try_again_button
source: Try Again
es: Intentar de Nuevo

# close_button
source: Close
es: Cerrar

# network_status_connected
source: Connected
es: Conectado

# network_status_disconnected
source: Disconnected
es: Desconectado

# test_primary_button
source: Primary Button
es: Botón Primario

# test_secondary_button
source: Secondary Button
es: Botón Secundario

# test_loading_button
source: Loading...
es: Cargando...

# test_disabled_button
source: Disabled
es: Deshabilitado

# quota_loading
source: Loading...
es: Cargando...

# quota_exhausted_message
source: You've reached your daily limit. Upgrade for more readings.
es: Has alcanzado tu límite diario. Actualiza para más lecturas.

# reading_start_ready_title
source: Ready to Begin?
es: ¿Listo para Comenzar?

# reading_start_quota_warning
source: This will use one of your daily free readings
es: Esto usará una de tus lecturas gratuitas diarias

# reading_start_reading_type_label
source: Reading Type:
es: Tipo de Lectura:

# reading_start_cultural_origin_label
source: Cultural Origin:
es: Origen Cultural:

# reading_start_processing_time
source: Processing time: ~10 seconds
es: Tiempo de procesamiento: ~10 segundos

# reading_start_processing
source: Processing...
es: Procesando...

# reading_start_button
source: Start Reading
es: Comenzar Lectura

# reading_start_cancel
source: Cancel
es: Cancelar

# reading_start_ok
source: OK
es: Aceptar

# reading_start_nav_title
source: Reading Setup
es: Configuración de Lectura

# reading_start_checking_quota
source: Checking quota...
es: Verificando cuota...

# reading_start_remaining_readings
source: %d readings remaining today
es: %d lecturas restantes hoy

# reading_start_not_authenticated
source: User not authenticated
es: Usuario no autenticado

# reading_start_failed
source: Failed to start reading: %@
es: Error al comenzar lectura: %@

# paywall_title
source: Unlock Unlimited Readings ✨
es: Desbloquea Lecturas Ilimitadas ✨

# paywall_subtitle
source: Get unlimited fortune readings, detailed reports, and premium features
es: Obtén lecturas ilimitadas, informes detallados y funciones premium

# paywall_monthly_title
source: Monthly
es: Mensual

# paywall_yearly_title
source: Yearly
es: Anual

# paywall_per_month
source: per month
es: por mes

# paywall_per_year
source: per year
es: por año

# paywall_monthly_tagline
source: Best for casual users
es: Mejor para usuarios ocasionales

# paywall_yearly_tagline
source: Best value for regular users
es: Mejor valor para usuarios regulares

# paywall_upgrade_button
source: Upgrade to Premium
es: Actualizar a Premium

# paywall_restore_button
source: Restore Purchases
es: Restaurar Compras

# paywall_close_button
source: Close
es: Cerrar

# paywall_coming_soon_title
source: Premium Coming Soon
es: Premium Próximamente

# paywall_coming_soon_message
source: Premium features will be available after App Store review. Thank you for your patience!
es: Las funciones premium estarán disponibles después de la revisión de App Store. ¡Gracias por tu paciencia!

# paywall_save_annually
source: Save 40% annually
es: Ahorra 40% anualmente

# paywall_recommended
source: RECOMMENDED
es: RECOMENDADO

# paywall_feature_unlimited
source: Unlimited daily readings
es: Lecturas diarias ilimitadas

# paywall_feature_reports
source: Detailed 10-page reports
es: Informes detallados de 10 páginas

# paywall_feature_share_cards
source: HD share cards (no watermark)
es: Tarjetas de compartir HD (sin marca de agua)

# paywall_feature_history
source: Reading history & trends
es: Historial de lecturas y tendencias

# paywall_feature_priority
source: Priority processing (< 5 seconds)
es: Procesamiento prioritario (< 5 segundos)

# paywall_feature_adfree
source: Ad-free experience
es: Experiencia sin anuncios

# permission_camera_title
source: Allow Camera Access
es: Permitir Acceso a la Cámara

# permission_camera_message
source: We need access to your camera to capture photos for your fortune reading 🌙
es: Necesitamos acceso a tu cámara para capturar fotos para tu lectura de fortuna 🌙

# permission_library_title
source: Allow Photo Library Access
es: Permitir Acceso a la Biblioteca de Fotos

# permission_library_message
source: We need access to your photo library to choose images for your fortune reading 🌙
es: Necesitamos acceso a tu biblioteca de fotos para elegir imágenes para tu lectura de fortuna 🌙

# permission_allow_button
source: Allow Access
es: Permitir Acceso

# permission_not_now_button
source: Not Now
es: Ahora No

# permission_cancel_button
source: Cancel
es: Cancelar

# permission_camera_denied_title
source: Camera Access Needed
es: Se Necesita Acceso a la Cámara

# permission_camera_denied_message
source: Please enable camera access in Settings to continue your mystical journey.
es: Por favor habilita el acceso a la cámara en Configuración para continuar tu viaje místico.

# permission_library_denied_title
source: Photo Library Access Needed
es: Se Necesita Acceso a la Biblioteca de Fotos

# permission_library_denied_message
source: Please enable photo library access in Settings to continue your mystical journey.
es: Por favor habilita el acceso a la biblioteca de fotos en Configuración para continuar tu viaje místico.

# permission_open_settings_button
source: Open Settings
es: Abrir Configuración

# alert_success_title
source: Success
es: Éxito

# alert_ok_button
source: OK
es: Aceptar

# error_network
source: Network connection error. Please check your internet connection.
es: Error de conexión de red. Por favor verifica tu conexión a internet.

# error_quota_exceeded
source: Daily quota exceeded. Upgrade to Premium for unlimited readings.
es: Cuota diaria excedida. Actualiza a Premium para lecturas ilimitadas.

# error_image_processing
source: Failed to process image. Please try again.
es: Error al procesar imagen. Inténtalo de nuevo.

# error_ai_processing
source: AI processing failed. Please try again.
es: Error en el procesamiento de IA. Inténtalo de nuevo.

# error_unknown
source: An unexpected error occurred. Please try again.
es: Ocurrió un error inesperado. Inténtalo de nuevo.

# success_reading_completed
source: Your fortune reading is ready!
es: ¡Tu lectura de fortuna está lista!

# success_image_uploaded
source: Image uploaded successfully
es: Imagen subida exitosamente

# success_quota_consumed
source: Reading completed successfully
es: Lectura completada exitosamente
